; domain
;; Enrico Scala (enricos83@gmail.com)
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; counters-ineq-rnd domain, functional strips version
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; This domain describes a set of counters that can be increased and decreased. The rate of such counter is however variable!

(define (domain fo-counters-rnd)
    (:requirements :strips :typing :fluents :adl)
    (:types counter)

    (:functions
        (value ?c - counter);; - int  ;; The value shown in counter ?c
        (rate_value ?c - counter);;
        (max_int);; -  int ;; The maximum integer we consider - a static value
    )

    ;; Increment the value in the given counter by one
    (:action increment
         :parameters (?c - counter)
         :precondition (and (<= (+ (value ?c) (rate_value ?c)) (max_int)))
         :effect (and (increase (value ?c) (rate_value ?c)))
    )
    ;; Decrement the value in the given counter by one
    (:action decrement
         :parameters (?c - counter)
         :precondition (and (>= (- (value ?c) (rate_value ?c)) 0))
         :effect (and (decrease (value ?c) (rate_value ?c)))
    )

    (:action increase_rate
         :parameters (?c - counter)
         :precondition (and (<= (+ (rate_value ?c) 1) 10))
         :effect (and (increase (rate_value ?c) 1))
    )

    (:action decrement_rate
         :parameters (?c - counter)
         :precondition (and (>= (rate_value ?c) 1))
         :effect (and (decrease (rate_value ?c) 1))
    )


)

; problem
;; Enrico Scala (enricos83@gmail.com) and Miquel Ramirez (miquel.ramirez@gmail.com)
(define (problem instance_13_100)
	(:domain fo-counters-rnd)
	(:objects
		c0 c1 c2 c3 c4 c5 c6 c7 c8 c9 c10 c11 c12 - counter
	)
  (:init
		(= (value c0) 42)
	(= (value c1) 30)
	(= (value c2) 88)
	(= (value c3) 22)
	(= (value c4) 88)
	(= (value c5) 60)
	(= (value c6) 11)
	(= (value c7) 98)
	(= (value c8) 36)
	(= (value c9) 56)
	(= (value c10) 64)
	(= (value c11) 92)
	(= (value c12) 6)

        (= (rate_value c0) 0)
	(= (rate_value c1) 0)
	(= (rate_value c2) 0)
	(= (rate_value c3) 0)
	(= (rate_value c4) 0)
	(= (rate_value c5) 0)
	(= (rate_value c6) 0)
	(= (rate_value c7) 0)
	(= (rate_value c8) 0)
	(= (rate_value c9) 0)
	(= (rate_value c10) 0)
	(= (rate_value c11) 0)
	(= (rate_value c12) 0)

		(= (max_int) 100)
	)
	(:goal
		(and
			(<= (+ (value c0) 1) (value c1))
	(<= (+ (value c1) 1) (value c2))
	(<= (+ (value c2) 1) (value c3))
	(<= (+ (value c3) 1) (value c4))
	(<= (+ (value c4) 1) (value c5))
	(<= (+ (value c5) 1) (value c6))
	(<= (+ (value c6) 1) (value c7))
	(<= (+ (value c7) 1) (value c8))
	(<= (+ (value c8) 1) (value c9))
	(<= (+ (value c9) 1) (value c10))
	(<= (+ (value c10) 1) (value c11))
	(<= (+ (value c11) 1) (value c12))
		)
	)
)

; plan
1. (increase_rate c1)
   changed: (rate_value c1) from 0 to 1
   goals met: 6 of 12
2. (increase_rate c1)
   changed: (rate_value c1) from 1 to 2
   goals met: 6 of 12
3. (increase_rate c0)
   changed: (rate_value c0) from 0 to 1
   goals met: 6 of 12
4. (increase_rate c0)
   changed: (rate_value c0) from 1 to 2
   goals met: 6 of 12
5. (increase_rate c1)
   changed: (rate_value c1) from 2 to 3
   goals met: 6 of 12
6. (increase_rate c1)
   changed: (rate_value c1) from 3 to 4
   goals met: 6 of 12
7. (increment c1)
   changed: (value c1) from 30 to 34
   goals met: 6 of 12
8. (increment c1)
   changed: (value c1) from 34 to 38
   goals met: 6 of 12
9. (increment c1)
   changed: (value c1) from 38 to 42
   goals met: 6 of 12
10. (increment c1)
   changed: (value c1) from 42 to 46
   goals met: 7 of 12
11. (increase_rate c12)
   changed: (rate_value c12) from 0 to 1
   goals met: 7 of 12
12. (increase_rate c12)
   changed: (rate_value c12) from 1 to 2
   goals met: 7 of 12
13. (increase_rate c11)
   changed: (rate_value c11) from 0 to 1
   goals met: 7 of 12
14. (increase_rate c12)
   changed: (rate_value c12) from 2 to 3
   goals met: 7 of 12
15. (increase_rate c12)
   changed: (rate_value c12) from 3 to 4
   goals met: 7 of 12
16. (increase_rate c12)
   changed: (rate_value c12) from 4 to 5
   goals met: 7 of 12
17. (increase_rate c12)
   changed: (rate_value c12) from 5 to 6
   goals met: 7 of 12
18. (increase_rate c12)
   changed: (rate_value c12) from 6 to 7
   goals met: 7 of 12
19. (increase_rate c11)
   changed: (rate_value c11) from 1 to 2
   goals met: 7 of 12
20. (increase_rate c11)
   changed: (rate_value c11) from 2 to 3
   goals met: 7 of 12
21. (increase_rate c11)
   changed: (rate_value c11) from 3 to 4
   goals met: 7 of 12
22. (increase_rate c11)
   changed: (rate_value c11) from 4 to 5
   goals met: 7 of 12
23. (increment c12)
   changed: (value c12) from 6 to 13
   goals met: 7 of 12
24. (increase_rate c12)
   changed: (rate_value c12) from 7 to 8
   goals met: 7 of 12
25. (increment c12)
   changed: (value c12) from 13 to 21
   goals met: 7 of 12
26. (increment c12)
   changed: (value c12) from 21 to 29
   goals met: 7 of 12
27. (increase_rate c12)
   changed: (rate_value c12) from 8 to 9
   goals met: 7 of 12
28. (increment c12)
   changed: (value c12) from 29 to 38
   goals met: 7 of 12
29. (increment c12)
   changed: (value c12) from 38 to 47
   goals met: 7 of 12
30. (increment c12)
   changed: (value c12) from 47 to 56
   goals met: 7 of 12
31. (increment c12)
   changed: (value c12) from 56 to 65
   goals met: 7 of 12
32. (increase_rate c12)
   changed: (rate_value c12) from 9 to 10
   goals met: 7 of 12
33. (increment c12)
   changed: (value c12) from 65 to 75
   goals met: 7 of 12
34. (increment c12)
   changed: (value c12) from 75 to 85
   goals met: 7 of 12
35. (increment c12)
   changed: (value c12) from 85 to 95
   goals met: 8 of 12
36. (increase_rate c8)
   changed: (rate_value c8) from 0 to 1
   goals met: 8 of 12
37. (increase_rate c8)
   changed: (rate_value c8) from 1 to 2
   goals met: 8 of 12
38. (increase_rate c7)
   changed: (rate_value c7) from 0 to 1
   goals met: 8 of 12
39. (increase_rate c8)
   changed: (rate_value c8) from 2 to 3
   goals met: 8 of 12
40. (increase_rate c8)
   changed: (rate_value c8) from 3 to 4
   goals met: 8 of 12
41. (increase_rate c8)
   changed: (rate_value c8) from 4 to 5
   goals met: 8 of 12
42. (increase_rate c7)
   changed: (rate_value c7) from 1 to 2
   goals met: 8 of 12
43. (increase_rate c8)
   changed: (rate_value c8) from 5 to 6
   goals met: 8 of 12
44. (increase_rate c7)
   changed: (rate_value c7) from 2 to 3
   goals met: 8 of 12
45. (increase_rate c7)
   changed: (rate_value c7) from 3 to 4
   goals met: 8 of 12
46. (increase_rate c8)
   changed: (rate_value c8) from 6 to 7
   goals met: 8 of 12
47. (increment c8)
   changed: (value c8) from 36 to 43
   goals met: 8 of 12
48. (increase_rate c8)
   changed: (rate_value c8) from 7 to 8
   goals met: 8 of 12
49. (increment c8)
   changed: (value c8) from 43 to 51
   goals met: 8 of 12
50. (increment c8)
   changed: (value c8) from 51 to 59
   goals met: 7 of 12
51. (increase_rate c8)
   changed: (rate_value c8) from 8 to 9
   goals met: 7 of 12
52. (increment c8)
   changed: (value c8) from 59 to 68
   goals met: 7 of 12
53. (decrement c7)
   changed: (value c7) from 98 to 94
   goals met: 7 of 12
54. (increase_rate c8)
   changed: (rate_value c8) from 9 to 10
   goals met: 7 of 12
55. (increase_rate c9)
   changed: (rate_value c9) from 0 to 1
   goals met: 7 of 12
56. (increase_rate c9)
   changed: (rate_value c9) from 1 to 2
   goals met: 7 of 12
57. (increase_rate c9)
   changed: (rate_value c9) from 2 to 3
   goals met: 7 of 12
58. (increase_rate c7)
   changed: (rate_value c7) from 4 to 5
   goals met: 7 of 12
59. (increase_rate c7)
   changed: (rate_value c7) from 5 to 6
   goals met: 7 of 12
60. (decrement c7)
   changed: (value c7) from 94 to 88
   goals met: 7 of 12
61. (decrement c7)
   changed: (value c7) from 88 to 82
   goals met: 7 of 12
62. (decrement c7)
   changed: (value c7) from 82 to 76
   goals met: 7 of 12
63. (decrement c7)
   changed: (value c7) from 76 to 70
   goals met: 7 of 12
64. (decrement c7)
   changed: (value c7) from 70 to 64
   goals met: 8 of 12
65. (increase_rate c6)
   changed: (rate_value c6) from 0 to 1
   goals met: 8 of 12
66. (increase_rate c6)
   changed: (rate_value c6) from 1 to 2
   goals met: 8 of 12
67. (increase_rate c6)
   changed: (rate_value c6) from 2 to 3
   goals met: 8 of 12
68. (increase_rate c6)
   changed: (rate_value c6) from 3 to 4
   goals met: 8 of 12
69. (increase_rate c6)
   changed: (rate_value c6) from 4 to 5
   goals met: 8 of 12
70. (increase_rate c6)
   changed: (rate_value c6) from 5 to 6
   goals met: 8 of 12
71. (increase_rate c6)
   changed: (rate_value c6) from 6 to 7
   goals met: 8 of 12
72. (increment c6)
   changed: (value c6) from 11 to 18
   goals met: 8 of 12
73. (increase_rate c6)
   changed: (rate_value c6) from 7 to 8
   goals met: 8 of 12
74. (increase_rate c6)
   changed: (rate_value c6) from 8 to 9
   goals met: 8 of 12
75. (increment c6)
   changed: (value c6) from 18 to 27
   goals met: 8 of 12
76. (increment c6)
   changed: (value c6) from 27 to 36
   goals met: 8 of 12
77. (increment c6)
   changed: (value c6) from 36 to 45
   goals met: 8 of 12
78. (increase_rate c6)
   changed: (rate_value c6) from 9 to 10
   goals met: 8 of 12
79. (increment c6)
   changed: (value c6) from 45 to 55
   goals met: 8 of 12
80. (increase_rate c5)
   changed: (rate_value c5) from 0 to 1
   goals met: 8 of 12
81. (increase_rate c5)
   changed: (rate_value c5) from 1 to 2
   goals met: 8 of 12
82. (increase_rate c5)
   changed: (rate_value c5) from 2 to 3
   goals met: 8 of 12
83. (increase_rate c5)
   changed: (rate_value c5) from 3 to 4
   goals met: 8 of 12
84. (increase_rate c5)
   changed: (rate_value c5) from 4 to 5
   goals met: 8 of 12
85. (increase_rate c5)
   changed: (rate_value c5) from 5 to 6
   goals met: 8 of 12
86. (increment c5)
   changed: (value c5) from 60 to 66
   goals met: 8 of 12
87. (increase_rate c5)
   changed: (rate_value c5) from 6 to 7
   goals met: 8 of 12
88. (increment c5)
   changed: (value c5) from 66 to 73
   goals met: 8 of 12
89. (increase_rate c5)
   changed: (rate_value c5) from 7 to 8
   goals met: 8 of 12
90. (increase_rate c5)
   changed: (rate_value c5) from 8 to 9
   goals met: 8 of 12
91. (increase_rate c5)
   changed: (rate_value c5) from 9 to 10
   goals met: 8 of 12
92. (increment c5)
   changed: (value c5) from 73 to 83
   goals met: 8 of 12
93. (increment c5)
   changed: (value c5) from 83 to 93
   goals met: 9 of 12
94. (increase_rate c3)
   changed: (rate_value c3) from 0 to 1
   goals met: 9 of 12
95. (increase_rate c3)
   changed: (rate_value c3) from 1 to 2
   goals met: 9 of 12
96. (increase_rate c3)
   changed: (rate_value c3) from 2 to 3
   goals met: 9 of 12
97. (increase_rate c3)
   changed: (rate_value c3) from 3 to 4
   goals met: 9 of 12
98. (increase_rate c3)
   changed: (rate_value c3) from 4 to 5
   goals met: 9 of 12
99. (increase_rate c3)
   changed: (rate_value c3) from 5 to 6
   goals met: 9 of 12
100. (increase_rate c3)
   changed: (rate_value c3) from 6 to 7
   goals met: 9 of 12
101. (increment c3)
   changed: (value c3) from 22 to 29
   goals met: 9 of 12
102. (increase_rate c3)
   changed: (rate_value c3) from 7 to 8
   goals met: 9 of 12
103. (increase_rate c3)
   changed: (rate_value c3) from 8 to 9
   goals met: 9 of 12
104. (increment c3)
   changed: (value c3) from 29 to 38
   goals met: 9 of 12
105. (increment c3)
   changed: (value c3) from 38 to 47
   goals met: 9 of 12
106. (increment c3)
   changed: (value c3) from 47 to 56
   goals met: 9 of 12
107. (increase_rate c2)
   changed: (rate_value c2) from 0 to 1
   goals met: 9 of 12
108. (increase_rate c2)
   changed: (rate_value c2) from 1 to 2
   goals met: 9 of 12
109. (increment c3)
   changed: (value c3) from 56 to 65
   goals met: 9 of 12
110. (increase_rate c3)
   changed: (rate_value c3) from 9 to 10
   goals met: 9 of 12
111. (increment c3)
   changed: (value c3) from 65 to 75
   goals met: 9 of 12
112. (increment c3)
   changed: (value c3) from 75 to 85
   goals met: 9 of 12
113. (decrement c2)
   changed: (value c2) from 88 to 86
   goals met: 9 of 12
114. (decrement c2)
   changed: (value c2) from 86 to 84
   goals met: 10 of 12
115. (increment c9)
   changed: (value c9) from 56 to 59
   goals met: 10 of 12
116. (increment c6)
   changed: (value c6) from 55 to 65
   goals met: 9 of 12
117. (increment c7)
   changed: (value c7) from 64 to 70
   goals met: 9 of 12
118. (decrement c8)
   changed: (value c8) from 68 to 58
   goals met: 10 of 12
119. (decrement c5)
   changed: (value c5) from 93 to 83
   goals met: 9 of 12
120. (increment c6)
   changed: (value c6) from 65 to 75
   goals met: 8 of 12
121. (increment c7)
   changed: (value c7) from 70 to 76
   goals met: 9 of 12
122. (increase_rate c7)
   changed: (rate_value c7) from 6 to 7
   goals met: 9 of 12
123. (increase_rate c7)
   changed: (rate_value c7) from 7 to 8
   goals met: 9 of 12
124. (increase_rate c7)
   changed: (rate_value c7) from 8 to 9
   goals met: 9 of 12
125. (increment c5)
   changed: (value c5) from 83 to 93
   goals met: 10 of 12
126. (increment c8)
   changed: (value c8) from 58 to 68
   goals met: 9 of 12
127. (increment c9)
   changed: (value c9) from 59 to 62
   goals met: 9 of 12
128. (increment c9)
   changed: (value c9) from 62 to 65
   goals met: 8 of 12
129. (increment c9)
   changed: (value c9) from 65 to 68
   goals met: 8 of 12
130. (increase_rate c10)
   changed: (rate_value c10) from 0 to 1
   goals met: 8 of 12
131. (increase_rate c10)
   changed: (rate_value c10) from 1 to 2
   goals met: 8 of 12
132. (increment c10)
   changed: (value c10) from 64 to 66
   goals met: 8 of 12
133. (increment c10)
   changed: (value c10) from 66 to 68
   goals met: 8 of 12
134. (increment c10)
   changed: (value c10) from 68 to 70
   goals met: 9 of 12
135. (increment c9)
   changed: (value c9) from 68 to 71
   goals met: 9 of 12
136. (increment c10)
   changed: (value c10) from 70 to 72
   goals met: 10 of 12
137. (increment c6)
   changed: (value c6) from 75 to 85
   goals met: 9 of 12
138. (decrement c7)
   changed: (value c7) from 76 to 67
   goals met: 10 of 12
139. (decrement c5)
   changed: (value c5) from 93 to 83
   goals met: 10 of 12
140. (increment c7)
   changed: (value c7) from 67 to 76
   goals met: 9 of 12
141. (increment c8)
   changed: (value c8) from 68 to 78
   goals met: 9 of 12
142. (increment c9)
   changed: (value c9) from 71 to 74
   goals met: 8 of 12
143. (increment c9)
   changed: (value c9) from 74 to 77
   goals met: 8 of 12
144. (increase_rate c10)
   changed: (rate_value c10) from 2 to 3
   goals met: 8 of 12
145. (increment c10)
   changed: (value c10) from 72 to 75
   goals met: 8 of 12
146. (increment c10)
   changed: (value c10) from 75 to 78
   goals met: 9 of 12
147. (increment c9)
   changed: (value c9) from 77 to 80
   goals met: 9 of 12
148. (increment c10)
   changed: (value c10) from 78 to 81
   goals met: 10 of 12
149. (increment c5)
   changed: (value c5) from 83 to 93
   goals met: 10 of 12
150. (increment c6)
   changed: (value c6) from 85 to 95
   goals met: 11 of 12
151. (increase_rate c7)
   changed: (rate_value c7) from 9 to 10
   goals met: 11 of 12
152. (increment c7)
   changed: (value c7) from 76 to 86
   goals met: 10 of 12
153. (increment c8)
   changed: (value c8) from 78 to 88
   goals met: 10 of 12
154. (increment c9)
   changed: (value c9) from 80 to 83
   goals met: 9 of 12
155. (increment c10)
   changed: (value c10) from 81 to 84
   goals met: 10 of 12
156. (increment c9)
   changed: (value c9) from 83 to 86
   goals met: 9 of 12
157. (increment c10)
   changed: (value c10) from 84 to 87
   goals met: 10 of 12
158. (increment c9)
   changed: (value c9) from 86 to 89
   goals met: 10 of 12
159. (increment c10)
   changed: (value c10) from 87 to 90
   goals met: 11 of 12
160. (increment c7)
   changed: (value c7) from 86 to 96
   goals met: 11 of 12
161. (increment c8)
   changed: (value c8) from 88 to 98
   goals met: 11 of 12
162. (increment c9)
   changed: (value c9) from 89 to 92
   goals met: 10 of 12
163. (increment c9)
   changed: (value c9) from 92 to 95
   goals met: 10 of 12
164. (increment c9)
   changed: (value c9) from 95 to 98
   goals met: 10 of 12
165. (increase_rate c9)
   changed: (rate_value c9) from 3 to 4
   goals met: 10 of 12
166. (increase_rate c9)
   changed: (rate_value c9) from 4 to 5
   goals met: 10 of 12
167. (decrement c9)
   changed: (value c9) from 98 to 93
   goals met: 10 of 12
168. (decrement c9)
   changed: (value c9) from 93 to 88
   goals met: 11 of 12
169. (decrement c8)
   changed: (value c8) from 98 to 88
   goals met: 10 of 12
170. (decrement c8)
   changed: (value c8) from 88 to 78
   goals met: 11 of 12
171. (decrement c7)
   changed: (value c7) from 96 to 86
   goals met: 10 of 12
172. (decrement c7)
   changed: (value c7) from 86 to 76
   goals met: 11 of 12
173. (decrement c6)
   changed: (value c6) from 95 to 85
   goals met: 10 of 12
174. (decrement c6)
   changed: (value c6) from 85 to 75
   goals met: 11 of 12
175. (decrement c5)
   changed: (value c5) from 93 to 83
   goals met: 10 of 12
176. (decrement c5)
   changed: (value c5) from 83 to 73
   goals met: 11 of 12
177. (increase_rate c4)
   changed: (rate_value c4) from 0 to 1
   goals met: 11 of 12
178. (increase_rate c4)
   changed: (rate_value c4) from 1 to 2
   goals met: 11 of 12
179. (increase_rate c4)
   changed: (rate_value c4) from 2 to 3
   goals met: 11 of 12
180. (increase_rate c4)
   changed: (rate_value c4) from 3 to 4
   goals met: 11 of 12
181. (decrement c4)
   changed: (value c4) from 88 to 84
   goals met: 10 of 12
182. (decrement c4)
   changed: (value c4) from 84 to 80
   goals met: 10 of 12
183. (decrement c4)
   changed: (value c4) from 80 to 76
   goals met: 10 of 12
184. (decrement c4)
   changed: (value c4) from 76 to 72
   goals met: 11 of 12
185. (decrement c3)
   changed: (value c3) from 85 to 75
   goals met: 10 of 12
186. (decrement c3)
   changed: (value c3) from 75 to 65
   goals met: 11 of 12
187. (increase_rate c2)
   changed: (rate_value c2) from 2 to 3
   goals met: 11 of 12
188. (increase_rate c2)
   changed: (rate_value c2) from 3 to 4
   goals met: 11 of 12
189. (increase_rate c2)
   changed: (rate_value c2) from 4 to 5
   goals met: 11 of 12
190. (decrement c2)
   changed: (value c2) from 84 to 79
   goals met: 11 of 12
191. (decrement c2)
   changed: (value c2) from 79 to 74
   goals met: 11 of 12
192. (decrement c2)
   changed: (value c2) from 74 to 69
   goals met: 11 of 12
193. (decrement c2)
   changed: (value c2) from 69 to 64
   goals met: 12 of 12
